andrewparlane/masters_uba/6617_sistemas_digitales/TP4/c/k66_uart_forwarder/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
    kPIN_MUX_DirectionInput = 0U,        /* Input direction */
    kPIN_MUX_DirectionOutput = 1U,       /* Output direction */
    kPIN_MUX_DirectionInputOrOutput = 2U /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 transmit data source select: UART1_TX pin */

/*! @name PORTC4 (coord A9), J1[4]/UART1_TX/FTM0_CH3/FB_AD11
  @{ */
#define BOARD_UART1_TX_PERIPHERAL UART1                        /*!<@brief Device name: UART1 */
#define BOARD_UART1_TX_SIGNAL TX                               /*!<@brief UART1 signal: TX */
#define BOARD_UART1_TX_PORT PORTC                              /*!<@brief PORT device name: PORTC */
#define BOARD_UART1_TX_PIN 4U                                  /*!<@brief PORTC pin index: 4 */
#define BOARD_UART1_TX_PIN_NAME UART1_TX                       /*!<@brief Pin name */
#define BOARD_UART1_TX_LABEL "J1[4]/UART1_TX/FTM0_CH3/FB_AD11" /*!<@brief Label */
#define BOARD_UART1_TX_NAME "UART1_TX"                         /*!<@brief Identifier name */
#define BOARD_UART1_TX_DIRECTION kPIN_MUX_DirectionOutput      /*!<@brief Direction */
                                                               /* @} */

/*! @name PORTC3 (coord A11), J1[2]/UART1_RX/FTM0_CH2/CLKOUT
  @{ */
#define BOARD_UART1_RX_PERIPHERAL UART1                       /*!<@brief Device name: UART1 */
#define BOARD_UART1_RX_SIGNAL RX                              /*!<@brief UART1 signal: RX */
#define BOARD_UART1_RX_PORT PORTC                             /*!<@brief PORT device name: PORTC */
#define BOARD_UART1_RX_PIN 3U                                 /*!<@brief PORTC pin index: 3 */
#define BOARD_UART1_RX_PIN_NAME UART1_RX                      /*!<@brief Pin name */
#define BOARD_UART1_RX_LABEL "J1[2]/UART1_RX/FTM0_CH2/CLKOUT" /*!<@brief Label */
#define BOARD_UART1_RX_NAME "UART1_RX"                        /*!<@brief Identifier name */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*! @name PORTD11 (coord B2), SW2
  @{ */
#define BOARD_SW2_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_SW2_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_SW2_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_SW2_GPIO_PIN 11U                      /*!<@brief PORTD pin index: 11 */
#define BOARD_SW2_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_SW2_PIN 11U                           /*!<@brief PORTD pin index: 11 */
#define BOARD_SW2_CHANNEL 11                        /*!<@brief GPIOD GPIO channel: 11 */
#define BOARD_SW2_PIN_NAME PTD11                    /*!<@brief Pin name */
#define BOARD_SW2_LABEL "SW2"                       /*!<@brief Label */
#define BOARD_SW2_NAME "SW2"                        /*!<@brief Identifier name */
#define BOARD_SW2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                    /* @} */

/*! @name PORTA10 (coord M9), SW3
  @{ */
#define BOARD_SW3_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_SW3_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_SW3_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_SW3_GPIO_PIN 10U                      /*!<@brief PORTA pin index: 10 */
#define BOARD_SW3_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_SW3_PIN 10U                           /*!<@brief PORTA pin index: 10 */
#define BOARD_SW3_CHANNEL 10                        /*!<@brief GPIOA GPIO channel: 10 */
#define BOARD_SW3_PIN_NAME PTA10                    /*!<@brief Pin name */
#define BOARD_SW3_LABEL "SW3"                       /*!<@brief Label */
#define BOARD_SW3_NAME "SW3"                        /*!<@brief Identifier name */
#define BOARD_SW3_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONs(void);

/*! @name PORTA11 (coord L9), LEDRGB_BLUE
  @{ */
#define BOARD_LED_BLUE_PERIPHERAL GPIOA                   /*!<@brief Device name: GPIOA */
#define BOARD_LED_BLUE_SIGNAL GPIO                        /*!<@brief GPIOA signal: GPIO */
#define BOARD_LED_BLUE_GPIO GPIOA                         /*!<@brief GPIO device name: GPIOA */
#define BOARD_LED_BLUE_GPIO_PIN 11U                       /*!<@brief PORTA pin index: 11 */
#define BOARD_LED_BLUE_PORT PORTA                         /*!<@brief PORT device name: PORTA */
#define BOARD_LED_BLUE_PIN 11U                            /*!<@brief PORTA pin index: 11 */
#define BOARD_LED_BLUE_CHANNEL 11                         /*!<@brief GPIOA GPIO channel: 11 */
#define BOARD_LED_BLUE_PIN_NAME PTA11                     /*!<@brief Pin name */
#define BOARD_LED_BLUE_LABEL "LEDRGB_BLUE"                /*!<@brief Label */
#define BOARD_LED_BLUE_NAME "LED_BLUE"                    /*!<@brief Identifier name */
#define BOARD_LED_BLUE_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                          /* @} */

/*! @name PORTE6 (coord E1), LEDRGB_GREEN
  @{ */
#define BOARD_LED_GREEN_PERIPHERAL GPIOE                   /*!<@brief Device name: GPIOE */
#define BOARD_LED_GREEN_SIGNAL GPIO                        /*!<@brief GPIOE signal: GPIO */
#define BOARD_LED_GREEN_GPIO GPIOE                         /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_GREEN_GPIO_PIN 6U                        /*!<@brief PORTE pin index: 6 */
#define BOARD_LED_GREEN_PORT PORTE                         /*!<@brief PORT device name: PORTE */
#define BOARD_LED_GREEN_PIN 6U                             /*!<@brief PORTE pin index: 6 */
#define BOARD_LED_GREEN_CHANNEL 6                          /*!<@brief GPIOE GPIO channel: 6 */
#define BOARD_LED_GREEN_PIN_NAME PTE6                      /*!<@brief Pin name */
#define BOARD_LED_GREEN_LABEL "LEDRGB_GREEN"               /*!<@brief Label */
#define BOARD_LED_GREEN_NAME "LED_GREEN"                   /*!<@brief Identifier name */
#define BOARD_LED_GREEN_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                           /* @} */

/*! @name PORTC9 (coord D7), LEDRGB_RED
  @{ */
#define BOARD_LED_RED_PERIPHERAL GPIOC                   /*!<@brief Device name: GPIOC */
#define BOARD_LED_RED_SIGNAL GPIO                        /*!<@brief GPIOC signal: GPIO */
#define BOARD_LED_RED_GPIO GPIOC                         /*!<@brief GPIO device name: GPIOC */
#define BOARD_LED_RED_GPIO_PIN 9U                        /*!<@brief PORTC pin index: 9 */
#define BOARD_LED_RED_PORT PORTC                         /*!<@brief PORT device name: PORTC */
#define BOARD_LED_RED_PIN 9U                             /*!<@brief PORTC pin index: 9 */
#define BOARD_LED_RED_CHANNEL 9                          /*!<@brief GPIOC GPIO channel: 9 */
#define BOARD_LED_RED_PIN_NAME PTC9                      /*!<@brief Pin name */
#define BOARD_LED_RED_LABEL "LEDRGB_RED"                 /*!<@brief Label */
#define BOARD_LED_RED_NAME "LED_RED"                     /*!<@brief Identifier name */
#define BOARD_LED_RED_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDs(void);

#define PORT_DFER_DFE_8_MASK 0x0100u /*!<@brief Digital Filter Enable Mask for item 8. */
#define PORT_DFER_DFE_9_MASK 0x0200u /*!<@brief Digital Filter Enable Mask for item 9. */

