andrewparlane/masters_uba/6617_sistemas_digitales/TP4/c/k66_uart_forwarder/pin_mux.h
/*! @name PORTD8 (coord C9), U8[4]/U19[11]/I2C0_SCL
  @{ */
#define BOARD_ACCEL_SCL_PERIPHERAL I2C0                /*!<@brief Device name: I2C0 */
#define BOARD_ACCEL_SCL_SIGNAL SCL                     /*!<@brief I2C0 signal: SCL */
#define BOARD_ACCEL_SCL_PORT PORTD                     /*!<@brief PORT device name: PORTD */
#define BOARD_ACCEL_SCL_PIN 8U                         /*!<@brief PORTD pin index: 8 */
#define BOARD_ACCEL_SCL_PIN_NAME I2C0_SCL              /*!<@brief Pin name */
#define BOARD_ACCEL_SCL_LABEL "U8[4]/U19[11]/I2C0_SCL" /*!<@brief Label */
#define BOARD_ACCEL_SCL_NAME "ACCEL_SCL"               /*!<@brief Identifier name */
                                                       /* @} */

/*! @name PORTD9 (coord B9), U8[6]/U19[12]/I2C0_SDA
  @{ */
#define BOARD_ACCEL_SDA_PERIPHERAL I2C0                /*!<@brief Device name: I2C0 */
#define BOARD_ACCEL_SDA_SIGNAL SDA                     /*!<@brief I2C0 signal: SDA */
#define BOARD_ACCEL_SDA_PORT PORTD                     /*!<@brief PORT device name: PORTD */
#define BOARD_ACCEL_SDA_PIN 9U                         /*!<@brief PORTD pin index: 9 */
#define BOARD_ACCEL_SDA_PIN_NAME I2C0_SDA              /*!<@brief Pin name */
#define BOARD_ACCEL_SDA_LABEL "U8[6]/U19[12]/I2C0_SDA" /*!<@brief Label */
#define BOARD_ACCEL_SDA_NAME "ACCEL_SDA"               /*!<@brief Identifier name */
                                                       /* @} */

/*! @name PORTC17 (coord D5), U8[11]/FXOS8700CQ_INT1
  @{ */
#define BOARD_ACCEL_INT1_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_ACCEL_INT1_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_ACCEL_INT1_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_ACCEL_INT1_GPIO_PIN 17U                      /*!<@brief PORTC pin index: 17 */
#define BOARD_ACCEL_INT1_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_ACCEL_INT1_PIN 17U                           /*!<@brief PORTC pin index: 17 */
#define BOARD_ACCEL_INT1_CHANNEL 17                        /*!<@brief GPIOC GPIO channel: 17 */
#define BOARD_ACCEL_INT1_PIN_NAME PTC17                    /*!<@brief Pin name */
#define BOARD_ACCEL_INT1_LABEL "U8[11]/FXOS8700CQ_INT1"    /*!<@brief Label */
#define BOARD_ACCEL_INT1_NAME "ACCEL_INT1"                 /*!<@brief Identifier name */
#define BOARD_ACCEL_INT1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                           /* @} */

/*! @name PORTC13 (coord D6), U8[9]/FXOS8700CQ_INT2
  @{ */
#define BOARD_ACCEL_INT2_PERIPHERAL GPIOC                  /*!<@brief Device name: GPIOC */
#define BOARD_ACCEL_INT2_SIGNAL GPIO                       /*!<@brief GPIOC signal: GPIO */
#define BOARD_ACCEL_INT2_GPIO GPIOC                        /*!<@brief GPIO device name: GPIOC */
#define BOARD_ACCEL_INT2_GPIO_PIN 13U                      /*!<@brief PORTC pin index: 13 */
#define BOARD_ACCEL_INT2_PORT PORTC                        /*!<@brief PORT device name: PORTC */
#define BOARD_ACCEL_INT2_PIN 13U                           /*!<@brief PORTC pin index: 13 */
#define BOARD_ACCEL_INT2_CHANNEL 13                        /*!<@brief GPIOC GPIO channel: 13 */
#define BOARD_ACCEL_INT2_PIN_NAME PTC13                    /*!<@brief Pin name */
#define BOARD_ACCEL_INT2_LABEL "U8[9]/FXOS8700CQ_INT2"     /*!<@brief Label */
#define BOARD_ACCEL_INT2_NAME "ACCEL_INT2"                 /*!<@brief Identifier name */
#define BOARD_ACCEL_INT2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCEL_I2C(void);

#define PORT_DFER_DFE_8_MASK 0x0100u /*!<@brief Digital Filter Enable Mask for item 8. */
#define PORT_DFER_DFE_9_MASK 0x0200u /*!<@brief Digital Filter Enable Mask for item 9. */

/*! @name PORTD9 (coord B9), U8[6]/U19[12]/I2C0_SDA
  @{ */
#define BOARD_GYRO_SDA_PERIPHERAL I2C0                /*!<@brief Device name: I2C0 */
#define BOARD_GYRO_SDA_SIGNAL SDA                     /*!<@brief I2C0 signal: SDA */
#define BOARD_GYRO_SDA_PORT PORTD                     /*!<@brief PORT device name: PORTD */
#define BOARD_GYRO_SDA_PIN 9U                         /*!<@brief PORTD pin index: 9 */
#define BOARD_GYRO_SDA_PIN_NAME I2C0_SDA              /*!<@brief Pin name */
#define BOARD_GYRO_SDA_LABEL "U8[6]/U19[12]/I2C0_SDA" /*!<@brief Label */
#define BOARD_GYRO_SDA_NAME "GYRO_SDA"                /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTD8 (coord C9), U8[4]/U19[11]/I2C0_SCL
  @{ */
#define BOARD_GYRO_SCL_PERIPHERAL I2C0                /*!<@brief Device name: I2C0 */
#define BOARD_GYRO_SCL_SIGNAL SCL                     /*!<@brief I2C0 signal: SCL */
#define BOARD_GYRO_SCL_PORT PORTD                     /*!<@brief PORT device name: PORTD */
#define BOARD_GYRO_SCL_PIN 8U                         /*!<@brief PORTD pin index: 8 */
#define BOARD_GYRO_SCL_PIN_NAME I2C0_SCL              /*!<@brief Pin name */
#define BOARD_GYRO_SCL_LABEL "U8[4]/U19[11]/I2C0_SCL" /*!<@brief Label */
#define BOARD_GYRO_SCL_NAME "GYRO_SCL"                /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTA29 (coord H11), U19[3]/FXAS21002_INT1
  @{ */
#define BOARD_GYRO_INT1_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_GYRO_INT1_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_GYRO_INT1_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_GYRO_INT1_GPIO_PIN 29U                      /*!<@brief PORTA pin index: 29 */
#define BOARD_GYRO_INT1_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_GYRO_INT1_PIN 29U                           /*!<@brief PORTA pin index: 29 */
#define BOARD_GYRO_INT1_CHANNEL 29                        /*!<@brief GPIOA GPIO channel: 29 */
#define BOARD_GYRO_INT1_PIN_NAME PTA29                    /*!<@brief Pin name */
#define BOARD_GYRO_INT1_LABEL "U19[3]/FXAS21002_INT1"     /*!<@brief Label */
#define BOARD_GYRO_INT1_NAME "GYRO_INT1"                  /*!<@brief Identifier name */
#define BOARD_GYRO_INT1_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                          /* @} */

/*! @name PORTA28 (coord H12), U19[2]/FXAS21002_INT2
  @{ */
#define BOARD_GYRO_INT2_PERIPHERAL GPIOA                  /*!<@brief Device name: GPIOA */
#define BOARD_GYRO_INT2_SIGNAL GPIO                       /*!<@brief GPIOA signal: GPIO */
#define BOARD_GYRO_INT2_GPIO GPIOA                        /*!<@brief GPIO device name: GPIOA */
#define BOARD_GYRO_INT2_GPIO_PIN 28U                      /*!<@brief PORTA pin index: 28 */
#define BOARD_GYRO_INT2_PORT PORTA                        /*!<@brief PORT device name: PORTA */
#define BOARD_GYRO_INT2_PIN 28U                           /*!<@brief PORTA pin index: 28 */
#define BOARD_GYRO_INT2_CHANNEL 28                        /*!<@brief GPIOA GPIO channel: 28 */
#define BOARD_GYRO_INT2_PIN_NAME PTA28                    /*!<@brief Pin name */
#define BOARD_GYRO_INT2_LABEL "U19[2]/FXAS21002_INT2"     /*!<@brief Label */
#define BOARD_GYRO_INT2_NAME "GYRO_INT2"                  /*!<@brief Identifier name */
#define BOARD_GYRO_INT2_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                          /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitGYRO_I2C(void);

#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 transmit data source select: UART0_TX pin */

