andrewparlane/masters_uba/6617_sistemas_digitales/TP4/c/k66_uart_forwarder/pin_mux.h
/*! @name PORTB16 (coord E10), U7[4]/UART0_RX
  @{ */
#define BOARD_DEBUG_UART_RX_PERIPHERAL UART0       /*!<@brief Device name: UART0 */
#define BOARD_DEBUG_UART_RX_SIGNAL RX              /*!<@brief UART0 signal: RX */
#define BOARD_DEBUG_UART_RX_PORT PORTB             /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_RX_PIN 16U                /*!<@brief PORTB pin index: 16 */
#define BOARD_DEBUG_UART_RX_PIN_NAME UART0_RX      /*!<@brief Pin name */
#define BOARD_DEBUG_UART_RX_LABEL "U7[4]/UART0_RX" /*!<@brief Label */
#define BOARD_DEBUG_UART_RX_NAME "DEBUG_UART_RX"   /*!<@brief Identifier name */
                                                   /* @} */

/*! @name PORTB17 (coord E9), U10[1]/UART0_TX
  @{ */
#define BOARD_DEBUG_UART_TX_PERIPHERAL UART0                   /*!<@brief Device name: UART0 */
#define BOARD_DEBUG_UART_TX_SIGNAL TX                          /*!<@brief UART0 signal: TX */
#define BOARD_DEBUG_UART_TX_PORT PORTB                         /*!<@brief PORT device name: PORTB */
#define BOARD_DEBUG_UART_TX_PIN 17U                            /*!<@brief PORTB pin index: 17 */
#define BOARD_DEBUG_UART_TX_PIN_NAME UART0_TX                  /*!<@brief Pin name */
#define BOARD_DEBUG_UART_TX_LABEL "U10[1]/UART0_TX"            /*!<@brief Label */
#define BOARD_DEBUG_UART_TX_NAME "DEBUG_UART_TX"               /*!<@brief Identifier name */
#define BOARD_DEBUG_UART_TX_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UART(void);

#define PORT_DFER_DFE_10_MASK 0x0400u /*!<@brief Digital Filter Enable Mask for item 10. */

/*! @name PORTE3 (coord E4), SDHC0_CMD
  @{ */
#define BOARD_SDHC0_CMD_PERIPHERAL SDHC    /*!<@brief Device name: SDHC */
#define BOARD_SDHC0_CMD_SIGNAL CMD         /*!<@brief SDHC signal: CMD */
#define BOARD_SDHC0_CMD_PORT PORTE         /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC0_CMD_PIN 3U             /*!<@brief PORTE pin index: 3 */
#define BOARD_SDHC0_CMD_PIN_NAME SDHC0_CMD /*!<@brief Pin name */
#define BOARD_SDHC0_CMD_LABEL "SDHC0_CMD"  /*!<@brief Label */
#define BOARD_SDHC0_CMD_NAME "SDHC0_CMD"   /*!<@brief Identifier name */
                                           /* @} */

/*! @name PORTE1 (coord D2), SDHC0_D0
  @{ */
#define BOARD_SDHC0_D0_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_SDHC0_D0_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_SDHC0_D0_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC0_D0_PIN 1U            /*!<@brief PORTE pin index: 1 */
#define BOARD_SDHC0_D0_CHANNEL 0         /*!<@brief SDHC DATA channel: 0 */
#define BOARD_SDHC0_D0_PIN_NAME SDHC0_D0 /*!<@brief Pin name */
#define BOARD_SDHC0_D0_LABEL "SDHC0_D0"  /*!<@brief Label */
#define BOARD_SDHC0_D0_NAME "SDHC0_D0"   /*!<@brief Identifier name */
                                         /* @} */

/*! @name PORTE0 (coord D3), SDHC0_D1
  @{ */
#define BOARD_SDHC0_D1_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_SDHC0_D1_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_SDHC0_D1_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC0_D1_PIN 0U            /*!<@brief PORTE pin index: 0 */
#define BOARD_SDHC0_D1_CHANNEL 1         /*!<@brief SDHC DATA channel: 1 */
#define BOARD_SDHC0_D1_PIN_NAME SDHC0_D1 /*!<@brief Pin name */
#define BOARD_SDHC0_D1_LABEL "SDHC0_D1"  /*!<@brief Label */
#define BOARD_SDHC0_D1_NAME "SDHC0_D1"   /*!<@brief Identifier name */
                                         /* @} */

/*! @name PORTE5 (coord E2), SDHC0_D2
  @{ */
#define BOARD_SDHC0_D2_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_SDHC0_D2_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_SDHC0_D2_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC0_D2_PIN 5U            /*!<@brief PORTE pin index: 5 */
#define BOARD_SDHC0_D2_CHANNEL 2         /*!<@brief SDHC DATA channel: 2 */
#define BOARD_SDHC0_D2_PIN_NAME SDHC0_D2 /*!<@brief Pin name */
#define BOARD_SDHC0_D2_LABEL "SDHC0_D2"  /*!<@brief Label */
#define BOARD_SDHC0_D2_NAME "SDHC0_D2"   /*!<@brief Identifier name */
                                         /* @} */

/*! @name PORTE4 (coord E3), SDHC0_D3
  @{ */
#define BOARD_SDHC0_D3_PERIPHERAL SDHC   /*!<@brief Device name: SDHC */
#define BOARD_SDHC0_D3_SIGNAL DATA       /*!<@brief SDHC signal: DATA */
#define BOARD_SDHC0_D3_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC0_D3_PIN 4U            /*!<@brief PORTE pin index: 4 */
#define BOARD_SDHC0_D3_CHANNEL 3         /*!<@brief SDHC DATA channel: 3 */
#define BOARD_SDHC0_D3_PIN_NAME SDHC0_D3 /*!<@brief Pin name */
#define BOARD_SDHC0_D3_LABEL "SDHC0_D3"  /*!<@brief Label */
#define BOARD_SDHC0_D3_NAME "SDHC0_D3"   /*!<@brief Identifier name */
                                         /* @} */

/*! @name PORTE2 (coord D1), SDHC0_DCLK
  @{ */
#define BOARD_SDHC0_DCLK_PERIPHERAL SDHC     /*!<@brief Device name: SDHC */
#define BOARD_SDHC0_DCLK_SIGNAL DCLK         /*!<@brief SDHC signal: DCLK */
#define BOARD_SDHC0_DCLK_PORT PORTE          /*!<@brief PORT device name: PORTE */
#define BOARD_SDHC0_DCLK_PIN 2U              /*!<@brief PORTE pin index: 2 */
#define BOARD_SDHC0_DCLK_PIN_NAME SDHC0_DCLK /*!<@brief Pin name */
#define BOARD_SDHC0_DCLK_LABEL "SDHC0_DCLK"  /*!<@brief Label */
#define BOARD_SDHC0_DCLK_NAME "SDHC0_DCLK"   /*!<@brief Identifier name */
                                             /* @} */

/*! @name PORTD10 (coord B3), SD_CARD_DETECT
  @{ */
#define BOARD_SDCARD_CARD_DETECTION_PERIPHERAL GPIOD                  /*!<@brief Device name: GPIOD */
#define BOARD_SDCARD_CARD_DETECTION_SIGNAL GPIO                       /*!<@brief GPIOD signal: GPIO */
#define BOARD_SDCARD_CARD_DETECTION_GPIO GPIOD                        /*!<@brief GPIO device name: GPIOD */
#define BOARD_SDCARD_CARD_DETECTION_GPIO_PIN 10U                      /*!<@brief PORTD pin index: 10 */
#define BOARD_SDCARD_CARD_DETECTION_PORT PORTD                        /*!<@brief PORT device name: PORTD */
#define BOARD_SDCARD_CARD_DETECTION_PIN 10U                           /*!<@brief PORTD pin index: 10 */
#define BOARD_SDCARD_CARD_DETECTION_CHANNEL 10                        /*!<@brief GPIOD GPIO channel: 10 */
#define BOARD_SDCARD_CARD_DETECTION_PIN_NAME PTD10                    /*!<@brief Pin name */
#define BOARD_SDCARD_CARD_DETECTION_LABEL "SD_CARD_DETECT"            /*!<@brief Label */
#define BOARD_SDCARD_CARD_DETECTION_NAME "SDCARD_CARD_DETECTION"      /*!<@brief Identifier name */
#define BOARD_SDCARD_CARD_DETECTION_DIRECTION kPIN_MUX_DirectionInput /*!<@brief Direction */
                                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHC0(void);

#define SOPT2_RMIISRC_ENET 0x01u /*!<@brief RMII clock source select: External bypass clock (ENET_1588_CLKIN). */

/*! @name PORTE26 (coord K4), U13[16]/ETHERNET_CLOCK
  @{ */
#define BOARD_ETHERNET_CLOCK_PERIPHERAL ENET                /*!<@brief Device name: ENET */
#define BOARD_ETHERNET_CLOCK_SIGNAL RMII_CLKIN              /*!<@brief ENET signal: RMII_CLKIN */
#define BOARD_ETHERNET_CLOCK_PORT PORTE                     /*!<@brief PORT device name: PORTE */
#define BOARD_ETHERNET_CLOCK_PIN 26U                        /*!<@brief PORTE pin index: 26 */
#define BOARD_ETHERNET_CLOCK_PIN_NAME ENET_1588_CLKIN       /*!<@brief Pin name */
#define BOARD_ETHERNET_CLOCK_LABEL "U13[16]/ETHERNET_CLOCK" /*!<@brief Label */
#define BOARD_ETHERNET_CLOCK_NAME "ETHERNET_CLOCK"          /*!<@brief Identifier name */
                                                            /* @} */

/*! @name PORTA14 (coord L10), U13[15]/RMII0_CRS_DV
  @{ */
#define BOARD_RMII0_CRS_DV_PERIPHERAL ENET              /*!<@brief Device name: ENET */
#define BOARD_RMII0_CRS_DV_SIGNAL RMII_CRS_DV           /*!<@brief ENET signal: RMII_CRS_DV */
#define BOARD_RMII0_CRS_DV_PORT PORTA                   /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_CRS_DV_PIN 14U                      /*!<@brief PORTA pin index: 14 */
#define BOARD_RMII0_CRS_DV_PIN_NAME RMII0_CRS_DV        /*!<@brief Pin name */
#define BOARD_RMII0_CRS_DV_LABEL "U13[15]/RMII0_CRS_DV" /*!<@brief Label */
#define BOARD_RMII0_CRS_DV_NAME "RMII0_CRS_DV"          /*!<@brief Identifier name */
                                                        /* @} */

/*! @name PORTB1 (coord H9), U13[11]/RMII0_MDC
  @{ */
#define BOARD_RMII0_MDC_PERIPHERAL ENET           /*!<@brief Device name: ENET */
#define BOARD_RMII0_MDC_SIGNAL RMII_MDC           /*!<@brief ENET signal: RMII_MDC */
#define BOARD_RMII0_MDC_PORT PORTB                /*!<@brief PORT device name: PORTB */
#define BOARD_RMII0_MDC_PIN 1U                    /*!<@brief PORTB pin index: 1 */
#define BOARD_RMII0_MDC_PIN_NAME RMII0_MDC        /*!<@brief Pin name */
#define BOARD_RMII0_MDC_LABEL "U13[11]/RMII0_MDC" /*!<@brief Label */
#define BOARD_RMII0_MDC_NAME "RMII0_MDC"          /*!<@brief Identifier name */
                                                  /* @} */

/*! @name PORTB0 (coord H10), U13[10]/RMII0_MDIO
  @{ */
#define BOARD_RMII0_MDIO_PERIPHERAL ENET            /*!<@brief Device name: ENET */
#define BOARD_RMII0_MDIO_SIGNAL RMII_MDIO           /*!<@brief ENET signal: RMII_MDIO */
#define BOARD_RMII0_MDIO_PORT PORTB                 /*!<@brief PORT device name: PORTB */
#define BOARD_RMII0_MDIO_PIN 0U                     /*!<@brief PORTB pin index: 0 */
#define BOARD_RMII0_MDIO_PIN_NAME RMII0_MDIO        /*!<@brief Pin name */
#define BOARD_RMII0_MDIO_LABEL "U13[10]/RMII0_MDIO" /*!<@brief Label */
#define BOARD_RMII0_MDIO_NAME "RMII0_MDIO"          /*!<@brief Identifier name */
                                                    /* @} */

/*! @name PORTA13 (coord J9), U13[13]/RMII0_RXD0
  @{ */
#define BOARD_RMII0_RXD0_PERIPHERAL ENET            /*!<@brief Device name: ENET */
#define BOARD_RMII0_RXD0_SIGNAL RMII_RXD0           /*!<@brief ENET signal: RMII_RXD0 */
#define BOARD_RMII0_RXD0_PORT PORTA                 /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_RXD0_PIN 13U                    /*!<@brief PORTA pin index: 13 */
#define BOARD_RMII0_RXD0_PIN_NAME RMII0_RXD0        /*!<@brief Pin name */
#define BOARD_RMII0_RXD0_LABEL "U13[13]/RMII0_RXD0" /*!<@brief Label */
#define BOARD_RMII0_RXD0_NAME "RMII0_RXD0"          /*!<@brief Identifier name */
                                                    /* @} */

/*! @name PORTA12 (coord K9), U13[12]/RMII0_RXD1
  @{ */
#define BOARD_RMII0_RXD1_PERIPHERAL ENET            /*!<@brief Device name: ENET */
#define BOARD_RMII0_RXD1_SIGNAL RMII_RXD1           /*!<@brief ENET signal: RMII_RXD1 */
#define BOARD_RMII0_RXD1_PORT PORTA                 /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_RXD1_PIN 12U                    /*!<@brief PORTA pin index: 12 */
#define BOARD_RMII0_RXD1_PIN_NAME RMII0_RXD1        /*!<@brief Pin name */
#define BOARD_RMII0_RXD1_LABEL "U13[12]/RMII0_RXD1" /*!<@brief Label */
#define BOARD_RMII0_RXD1_NAME "RMII0_RXD1"          /*!<@brief Identifier name */
                                                    /* @} */

/*! @name PORTA5 (coord M8), U13[17]/RMII0_RXER
  @{ */
#define BOARD_RMII0_RXER_PERIPHERAL ENET            /*!<@brief Device name: ENET */
#define BOARD_RMII0_RXER_SIGNAL RMII_RXER           /*!<@brief ENET signal: RMII_RXER */
#define BOARD_RMII0_RXER_PORT PORTA                 /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_RXER_PIN 5U                     /*!<@brief PORTA pin index: 5 */
#define BOARD_RMII0_RXER_PIN_NAME RMII0_RXER        /*!<@brief Pin name */
#define BOARD_RMII0_RXER_LABEL "U13[17]/RMII0_RXER" /*!<@brief Label */
#define BOARD_RMII0_RXER_NAME "RMII0_RXER"          /*!<@brief Identifier name */
                                                    /* @} */

