andrewparlane/masters_uba/6617_sistemas_digitales/TP4/c/k66_uart_forwarder/pin_mux.h
/*! @name PORTA16 (coord K10), U13[20]/RMII0_TXD_0
  @{ */
#define BOARD_RMII0_TXD_0_PERIPHERAL ENET             /*!<@brief Device name: ENET */
#define BOARD_RMII0_TXD_0_SIGNAL RMII_TXD0            /*!<@brief ENET signal: RMII_TXD0 */
#define BOARD_RMII0_TXD_0_PORT PORTA                  /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_TXD_0_PIN 16U                     /*!<@brief PORTA pin index: 16 */
#define BOARD_RMII0_TXD_0_PIN_NAME RMII0_TXD0         /*!<@brief Pin name */
#define BOARD_RMII0_TXD_0_LABEL "U13[20]/RMII0_TXD_0" /*!<@brief Label */
#define BOARD_RMII0_TXD_0_NAME "RMII0_TXD_0"          /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTA17 (coord K11), U13[21]/RMII0_TXD_1
  @{ */
#define BOARD_RMII0_TXD_1_PERIPHERAL ENET             /*!<@brief Device name: ENET */
#define BOARD_RMII0_TXD_1_SIGNAL RMII_TXD1            /*!<@brief ENET signal: RMII_TXD1 */
#define BOARD_RMII0_TXD_1_PORT PORTA                  /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_TXD_1_PIN 17U                     /*!<@brief PORTA pin index: 17 */
#define BOARD_RMII0_TXD_1_PIN_NAME RMII0_TXD1         /*!<@brief Pin name */
#define BOARD_RMII0_TXD_1_LABEL "U13[21]/RMII0_TXD_1" /*!<@brief Label */
#define BOARD_RMII0_TXD_1_NAME "RMII0_TXD_1"          /*!<@brief Identifier name */
                                                      /* @} */

/*! @name PORTA15 (coord L11), U13[19]/RMII0_TXEN
  @{ */
#define BOARD_RMII0_TXEN_PERIPHERAL ENET            /*!<@brief Device name: ENET */
#define BOARD_RMII0_TXEN_SIGNAL RMII_TXEN           /*!<@brief ENET signal: RMII_TXEN */
#define BOARD_RMII0_TXEN_PORT PORTA                 /*!<@brief PORT device name: PORTA */
#define BOARD_RMII0_TXEN_PIN 15U                    /*!<@brief PORTA pin index: 15 */
#define BOARD_RMII0_TXEN_PIN_NAME RMII0_TXEN        /*!<@brief Pin name */
#define BOARD_RMII0_TXEN_LABEL "U13[19]/RMII0_TXEN" /*!<@brief Label */
#define BOARD_RMII0_TXEN_NAME "RMII0_TXEN"          /*!<@brief Identifier name */
                                                    /* @} */

/*! @name PORTE26 (coord K4), U13[16]/ETHERNET_CLOCK
  @{ */
#define BOARD_ENET_1588_CLKIN_PERIPHERAL ENET                /*!<@brief Device name: ENET */
#define BOARD_ENET_1588_CLKIN_SIGNAL CLKIN_1588              /*!<@brief ENET signal: CLKIN_1588 */
#define BOARD_ENET_1588_CLKIN_PORT PORTE                     /*!<@brief PORT device name: PORTE */
#define BOARD_ENET_1588_CLKIN_PIN 26U                        /*!<@brief PORTE pin index: 26 */
#define BOARD_ENET_1588_CLKIN_PIN_NAME ENET_1588_CLKIN       /*!<@brief Pin name */
#define BOARD_ENET_1588_CLKIN_LABEL "U13[16]/ETHERNET_CLOCK" /*!<@brief Label */
#define BOARD_ENET_1588_CLKIN_NAME "ENET_1588_CLKIN"         /*!<@brief Identifier name */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitENET(void);

/*! @name USB1_DM (coord K1), K66_MICRO_USB_DN
  @{ */
#define BOARD_K66_MICRO_USB_DN_DCD_PERIPHERAL USBHSDCD         /*!<@brief Device name: USBHSDCD */
#define BOARD_K66_MICRO_USB_DN_DCD_SIGNAL DM                   /*!<@brief USBHSDCD signal: DM */
#define BOARD_K66_MICRO_USB_DN_DCD_PIN_NAME USB1_DM            /*!<@brief Pin name */
#define BOARD_K66_MICRO_USB_DN_DCD_LABEL "K66_MICRO_USB_DN"    /*!<@brief Label */
#define BOARD_K66_MICRO_USB_DN_DCD_NAME "K66_MICRO_USB_DN_DCD" /*!<@brief Identifier name */
                                                               /* @} */

/*! @name USB1_DP (coord J1), K66_MICRO_USB_DP
  @{ */
#define BOARD_K66_MICRO_USB_DP_DCD_PERIPHERAL USBHSDCD         /*!<@brief Device name: USBHSDCD */
#define BOARD_K66_MICRO_USB_DP_DCD_SIGNAL DP                   /*!<@brief USBHSDCD signal: DP */
#define BOARD_K66_MICRO_USB_DP_DCD_PIN_NAME USB1_DP            /*!<@brief Pin name */
#define BOARD_K66_MICRO_USB_DP_DCD_LABEL "K66_MICRO_USB_DP"    /*!<@brief Label */
#define BOARD_K66_MICRO_USB_DP_DCD_NAME "K66_MICRO_USB_DP_DCD" /*!<@brief Identifier name */
                                                               /* @} */

/*! @name USB1_DM (coord K1), K66_MICRO_USB_DN
  @{ */
#define BOARD_K66_MICRO_USB_DN_PHY_PERIPHERAL USBPHY           /*!<@brief Device name: USBPHY */
#define BOARD_K66_MICRO_USB_DN_PHY_SIGNAL DM                   /*!<@brief USBPHY signal: DM */
#define BOARD_K66_MICRO_USB_DN_PHY_PIN_NAME USB1_DM            /*!<@brief Pin name */
#define BOARD_K66_MICRO_USB_DN_PHY_LABEL "K66_MICRO_USB_DN"    /*!<@brief Label */
#define BOARD_K66_MICRO_USB_DN_PHY_NAME "K66_MICRO_USB_DN_PHY" /*!<@brief Identifier name */
                                                               /* @} */

/*! @name USB1_DP (coord J1), K66_MICRO_USB_DP
  @{ */
#define BOARD_K66_MICRO_USB_DP_PHY_PERIPHERAL USBPHY           /*!<@brief Device name: USBPHY */
#define BOARD_K66_MICRO_USB_DP_PHY_SIGNAL DP                   /*!<@brief USBPHY signal: DP */
#define BOARD_K66_MICRO_USB_DP_PHY_PIN_NAME USB1_DP            /*!<@brief Pin name */
#define BOARD_K66_MICRO_USB_DP_PHY_LABEL "K66_MICRO_USB_DP"    /*!<@brief Label */
#define BOARD_K66_MICRO_USB_DP_PHY_NAME "K66_MICRO_USB_DP_PHY" /*!<@brief Identifier name */
                                                               /* @} */

/*! @name PORTE10 (coord F1), USB_ID
  @{ */
#define BOARD_USB_ID_PERIPHERAL USBPHY /*!<@brief Device name: USBPHY */
#define BOARD_USB_ID_SIGNAL ID         /*!<@brief USBPHY signal: ID */
#define BOARD_USB_ID_PORT PORTE        /*!<@brief PORT device name: PORTE */
#define BOARD_USB_ID_PIN 10U           /*!<@brief PORTE pin index: 10 */
#define BOARD_USB_ID_PIN_NAME USB1_ID  /*!<@brief Pin name */
#define BOARD_USB_ID_LABEL "USB_ID"    /*!<@brief Label */
#define BOARD_USB_ID_NAME "USB_ID"     /*!<@brief Identifier name */
                                       /* @} */

/*! @name USB1_VBUS (coord L1), P5V_K66_USB
  @{ */
#define BOARD_P5V_K66_USB_PERIPHERAL USBPHY   /*!<@brief Device name: USBPHY */
#define BOARD_P5V_K66_USB_SIGNAL VBUS         /*!<@brief USBPHY signal: VBUS */
#define BOARD_P5V_K66_USB_PIN_NAME USB1_VBUS  /*!<@brief Pin name */
#define BOARD_P5V_K66_USB_LABEL "P5V_K66_USB" /*!<@brief Label */
#define BOARD_P5V_K66_USB_NAME "P5V_K66_USB"  /*!<@brief Identifier name */
                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSB(void);

/*! @name PORTA18 (coord M12), EXTAL0
  @{ */
#define BOARD_EXTAL0_PERIPHERAL OSC  /*!<@brief Device name: OSC */
#define BOARD_EXTAL0_SIGNAL EXTAL0   /*!<@brief OSC signal: EXTAL0 */
#define BOARD_EXTAL0_PORT PORTA      /*!<@brief PORT device name: PORTA */
#define BOARD_EXTAL0_PIN 18U         /*!<@brief PORTA pin index: 18 */
#define BOARD_EXTAL0_PIN_NAME EXTAL0 /*!<@brief Pin name */
#define BOARD_EXTAL0_LABEL "EXTAL0"  /*!<@brief Label */
#define BOARD_EXTAL0_NAME "EXTAL0"   /*!<@brief Identifier name */
                                     /* @} */

/*! @name PORTA19 (coord M11), X501[3]
  @{ */
#define BOARD_XTAL0_PERIPHERAL OSC  /*!<@brief Device name: OSC */
#define BOARD_XTAL0_SIGNAL XTAL0    /*!<@brief OSC signal: XTAL0 */
#define BOARD_XTAL0_PORT PORTA      /*!<@brief PORT device name: PORTA */
#define BOARD_XTAL0_PIN 19U         /*!<@brief PORTA pin index: 19 */
#define BOARD_XTAL0_PIN_NAME XTAL0  /*!<@brief Pin name */
#define BOARD_XTAL0_LABEL "X501[3]" /*!<@brief Label */
#define BOARD_XTAL0_NAME "XTAL0"    /*!<@brief Identifier name */
                                    /* @} */

/*! @name EXTAL32 (coord M6), Y3[2]
  @{ */
#define BOARD_EXTAL32K_PERIPHERAL RTC   /*!<@brief Device name: RTC */
#define BOARD_EXTAL32K_SIGNAL EXTAL32   /*!<@brief RTC signal: EXTAL32 */
#define BOARD_EXTAL32K_PIN_NAME EXTAL32 /*!<@brief Pin name */
#define BOARD_EXTAL32K_LABEL "Y3[2]"    /*!<@brief Label */
#define BOARD_EXTAL32K_NAME "EXTAL32K"  /*!<@brief Identifier name */
                                        /* @} */

/*! @name XTAL32 (coord M7), Y3[1]
  @{ */
#define BOARD_XTAL32K_PERIPHERAL RTC  /*!<@brief Device name: RTC */
#define BOARD_XTAL32K_SIGNAL XTAL32   /*!<@brief RTC signal: XTAL32 */
#define BOARD_XTAL32K_PIN_NAME XTAL32 /*!<@brief Pin name */
#define BOARD_XTAL32K_LABEL "Y3[1]"   /*!<@brief Label */
#define BOARD_XTAL32K_NAME "XTAL32K"  /*!<@brief Identifier name */
                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCs(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
